// เพิ่มการทำงานคลิกแสดงข้อความแบบสุ่ม
const messages = [
  'เธอเก่งที่สุดแล้วนะเบ๊บ',
  'ขอบคุณที่เกิดมาน่ารักขนาดนี้นะ',
  'สู้ต่อนะเบบี๋ แค่นี้ไม่เกินใจยังไงคนเก่งของเค้าก็ทำได้',
  'อย่าลืมกินข้าวใหเอ้วนๆเลยนะ',
  'ไม่ว่าใครจะว่ายังไง เค้าอยู่ข้างๆเธอเสมอนะ',
  'วันนี้เธอสวยมากๆเลย ยิ่งตอนยิ้มแทบจะละลายแล้วค่ะ',
  'อุ้ยๆ คนที่อ่านใชช่คนที่เก่งที่สุดในโลกมั๊ยนะ',
  'อยากกินอาไยบอกนะะ เดะแทนจะพาไปกิน  ิ ิ',
  'เพราะเธอมีคนเดียวในโลกเค้าถึงอยากรักษาเธอไว้ให้อยู่กับเค้านานที่สุด',
  'คนบ้าอะไรจะน่ารักขนาดนี้',
  'อย่าใส่ใจคำพูดคนอื่นเลยนะ ไม่ได้มีแต่คนหวังดีกับเราเสมอไป',
  'ขอบคุณที่คอยทำให้แทนยิ้มได้ในทุกๆวันนะ'
];

document.getElementById('heartImage').addEventListener('click', function() {
  const randomIndex = Math.floor(Math.random() * messages.length);
  const randomMessage = messages[randomIndex];
  alert(randomMessage);
});
